:PROPERTIES:
:AUTHOR: Ian S. Pringle
:CREATED: <2022-08-04 Thu>
:MODIFIED: <2022-09-26 Mon 17:21>
:PRIVATE: t
:TYPE: todo
:END:
#+title: Life
#+startup: overview

* Clock Tables
** This Work Week
#+BEGIN: clocktable :scope file-with-archives :maxlevel 3 :step day :block thisweek :match "@work|MEETING"

Daily report: [2023-05-22 Mon]
| Headline                  | Time |      |      |
|---------------------------+------+------+------|
| *Total time*                | *6:41* |      |      |
|---------------------------+------+------+------|
| Tasks                     | 5:43 |      |      |
| \_  CUS-2343...           |      | 5:43 |      |
| \_    second round review |      |      | 5:16 |
| Meeting                   | 0:58 |      |      |
| \_  with sig-tulip        |      | 0:58 |      |
|---------------------------+------+------+------|

Daily report: [2023-05-23 Tue]
| Headline                                     | Time |      |      |
|----------------------------------------------+------+------+------|
| *Total time*                                   | *7:09* |      |      |
|----------------------------------------------+------+------+------|
| Tasks                                        | 7:09 |      |      |
| \_  CUS-2343...                              |      | 6:49 |      |
| \_    use currency func to display amount    |      |      | 0:34 |
| \_    update jha-wc input base to disable... |      |      | 0:11 |
| \_  CUS-2033 transit wire request            |      | 0:20 |      |
|----------------------------------------------+------+------+------|

Daily report: [2023-05-24 Wed]
| Headline                          | Time |      |
|-----------------------------------+------+------|
| *Total time*                        | *9:50* |      |
|-----------------------------------+------+------|
| Tasks                             | 8:45 |      |
| \_  CUS-2033 transit wire request |      | 8:10 |
| \_  complete self assessment      |      | 0:35 |
| Meeting                           | 1:05 |      |
| \_  with ux team                  |      | 1:05 |
|-----------------------------------+------+------|

Daily report: [2023-05-25 Thu]
| Headline   | Time |
|------------+------|
| *Total time* | *0:00* |

Daily report: [2023-05-26 Fri]
| Headline   | Time |
|------------+------|
| *Total time* | *0:00* |

Daily report: [2023-05-27 Sat]
| Headline   | Time |
|------------+------|
| *Total time* | *0:00* |

Daily report: [2023-05-28 Sun]
| Headline   | Time |
|------------+------|
| *Total time* | *0:00* |
#+END:
** Last Work Week
#+BEGIN: clocktable :scope file-with-archives :maxlevel 3 :step day :block lastweek :match "@work|MEETING"

Daily report: [2023-05-15 Mon]
| Headline                                     | Time |      |      |
|----------------------------------------------+------+------+------|
| *Total time*                                   | *4:38* |      |      |
|----------------------------------------------+------+------+------|
| Tasks                                        | 4:27 |      |      |
| \_  CUS-2343...                              |      | 4:27 |      |
| \_    complete the confirmation pane         |      |      | 0:22 |
| \_    setup post-confirmation pane           |      |      | 0:40 |
| \_    fix section headings on inspect,...    |      |      | 0:09 |
| \_    Add 'Address 2' labels to inspect,...  |      |      | 0:16 |
| \_    'Confirm' button should say 'Transfer' |      |      | 0:10 |
| \_    when adding new beneficiary, change... |      |      | 0:57 |
| Generic Tasks                                | 0:11 |      |      |
| \_  Break                                    |      | 0:11 |      |
|----------------------------------------------+------+------+------|

Daily report: [2023-05-16 Tue]
| Headline                                  | Time |      |      |
|-------------------------------------------+------+------+------|
| *Total time*                                | *5:34* |      |      |
|-------------------------------------------+------+------+------|
| Tasks                                     | 3:14 |      |      |
| \_  CUS-2343...                           |      | 3:14 |      |
| \_    error handling, including memo-mode |      |      | 0:28 |
| \_    add the delete functionality for... |      |      | 1:35 |
| Meeting                                   | 2:20 |      |      |
| \_  with ux team                          |      | 0:49 |      |
| \_  with custom team                      |      | 1:31 |      |
|-------------------------------------------+------+------+------|

Daily report: [2023-05-17 Wed]
| Headline                                      | Time |      |      |
|-----------------------------------------------+------+------+------|
| *Total time*                                    | *8:52* |      |      |
|-----------------------------------------------+------+------+------|
| Tasks                                         | 8:03 |      |      |
| \_  CUS-2343...                               |      | 8:03 |      |
| \_    bring styles into alignment with design |      |      | 5:33 |
| Meeting                                       | 0:49 |      |      |
| \_  with Brian (1:1)                          |      | 0:49 |      |
|-----------------------------------------------+------+------+------|

Daily report: [2023-05-18 Thu]
| Headline                              | Time |      |      |
|---------------------------------------+------+------+------|
| *Total time*                            | *7:18* |      |      |
|---------------------------------------+------+------+------|
| Tasks                                 | 5:43 |      |      |
| \_  CUS-2343...                       |      | 5:43 |      |
| \_    fix odd behavior in UAT when... |      |      | 1:01 |
| Meeting                               | 1:35 |      |      |
| \_  with custom dev                   |      | 1:35 |      |
|---------------------------------------+------+------+------|

Daily report: [2023-05-19 Fri]
| Headline                              | Time |      |      |
|---------------------------------------+------+------+------|
| *Total time*                            | *7:17* |      |      |
|---------------------------------------+------+------+------|
| Tasks                                 | 6:17 |      |      |
| \_  CUS-2343...                       |      | 4:50 |      |
| \_    update PO based on review       |      |      | 3:08 |
| \_  CUS-2013 improve mocking          |      | 1:27 |      |
| \_    create demo po for mock testing |      |      | 1:26 |
| Generic Tasks                         | 1:00 |      |      |
| \_  Break                             |      | 1:00 |      |
|---------------------------------------+------+------+------|

Daily report: [2023-05-20 Sat]
| Headline   | Time |
|------------+------|
| *Total time* | *0:00* |

Daily report: [2023-05-21 Sun]
| Headline   | Time |
|------------+------|
| *Total time* | *0:00* |
#+END:
* Inbox
** TODO look into increasing the timeout on completion pop-ups while in orgmode
:LOGBOOK:
CLOCK: [2023-05-28 Sun 06:17]--[2023-05-28 Sun 06:18] =>  0:01
:END:
CREATED: [2023-05-28 Sun 06:17]
** TODO Checkout making RET "better" in orgmode  :ORG:
:LOGBOOK:
CLOCK: [2023-08-07 Mon 05:41]--[2023-08-07 Mon 05:44] =>  0:03
:END:
CREATED: [2023-08-07 Mon 05:41]
There are some articles out there and a package or two that'll make =RET= in
orgmode act like it does in most other word processors and editors when in the
body of a list. Basically if you're in a list, make =RET= act like =M-RET=.
- https://github.com/howardabrams/dot-files/blob/master/emacs-org.org#better-org-return
- https://kitchingroup.cheme.cmu.edu/blog/2017/04/09/A-better-return-in-org-mode/
- https://emacs.stackexchange.com/questions/24574/org-mode-default-to-alt-enter-for-bullets
- https://github.com/calvinwyoung/org-autolist

* Tasks :TASKS:
** TODO Setup TODO captures to prompt for tags and priority after capturing todo data :ORG:
:LOGBOOK:
CLOCK: [2023-04-27 Thu 14:39]--[2023-04-27 Thu 14:54] =>  0:15
CLOCK: [2023-04-27 Thu 14:38]--[2023-04-27 Thu 14:39] =>  0:01
CLOCK: [2022-08-15 Mon 12:16]--[2022-08-15 Mon 12:17] =>  0:01
:END:
CREATED: [2022-08-15 Mon 12:16]
** TODO Make Sylvan configurable from an org file  :BLOG:ORG:@home:
:LOGBOOK:
CLOCK: [2022-09-03 Sat 07:13]--[2022-09-03 Sat 07:16] =>  0:03
:END:
CREATED: [2022-09-03 Sat 07:13]
Perhaps use =sylvan.org= in the root dir. I'm not sure how to express the configuration as data just yet, but it would need to include:
- special paths object
- list of links for nav header
- maybe pipeline to run?
- favicon override?
- fleuron bool/override?
- logo override?
- root index settings (probably better to do this in the root's index.org tbh)?

Also would like to make =index.org= a special file for sylvan that it will render as the index for a dir? Might not IDK yet
** TODO CUS-2343 polish-slavic-wire-request-poweron [22/22]  :@work:
:PROPERTIES:
:ID:       fd4c7d3b-8a54-42bf-a301-98b75cc2c468
:END:
:LOGBOOK:
CLOCK: [2023-05-23 Tue 12:50]--[2023-05-23 Tue 16:39] =>  3:49
CLOCK: [2023-05-23 Tue 11:28]--[2023-05-23 Tue 11:53] =>  0:25
CLOCK: [2023-05-23 Tue 09:39]--[2023-05-23 Tue 11:28] =>  1:49
CLOCK: [2023-05-23 Tue 09:26]--[2023-05-23 Tue 09:27] =>  0:01
CLOCK: [2023-05-22 Mon 16:59]--[2023-05-22 Mon 17:26] =>  0:27
CLOCK: [2023-05-19 Fri 15:19]--[2023-05-19 Fri 17:00] =>  1:41
CLOCK: [2023-05-19 Fri 12:51]--[2023-05-19 Fri 12:52] =>  0:01
CLOCK: [2023-05-18 Thu 11:53]--[2023-05-18 Thu 16:33] =>  4:40
CLOCK: [2023-05-18 Thu 10:16]--[2023-05-18 Thu 10:18] =>  0:02
CLOCK: [2023-05-17 Wed 08:30]--[2023-05-17 Wed 11:00] =>  2:30
CLOCK: [2023-05-16 Tue 16:23]--[2023-05-16 Tue 16:45] =>  0:22
CLOCK: [2023-05-16 Tue 15:36]--[2023-05-16 Tue 15:55] =>  0:19
CLOCK: [2023-05-16 Tue 12:00]--[2023-05-16 Tue 12:30] =>  0:30
CLOCK: [2023-05-15 Mon 15:48]--[2023-05-15 Mon 16:25] =>  0:37
CLOCK: [2023-05-15 Mon 14:45]--[2023-05-15 Mon 14:57] =>  0:12
CLOCK: [2023-05-15 Mon 13:32]--[2023-05-15 Mon 14:14] =>  0:42
CLOCK: [2023-05-15 Mon 12:27]--[2023-05-15 Mon 12:36] =>  0:09
CLOCK: [2023-05-15 Mon 12:16]--[2023-05-15 Mon 12:17] =>  0:01
CLOCK: [2023-05-15 Mon 12:00]--[2023-05-15 Mon 12:01] =>  0:01
CLOCK: [2023-05-15 Mon 11:57]--[2023-05-15 Mon 11:58] =>  0:01
CLOCK: [2023-05-15 Mon 11:47]--[2023-05-15 Mon 11:57] =>  0:10
CLOCK: [2023-05-12 Fri 13:56]--[2023-05-12 Fri 16:34] =>  2:38
CLOCK: [2023-05-11 Thu 14:20]--[2023-05-11 Thu 14:21] =>  0:01
CLOCK: [2023-05-11 Thu 12:43]--[2023-05-11 Thu 12:57] =>  0:14
CLOCK: [2023-05-11 Thu 11:24]--[2023-05-11 Thu 12:00] =>  0:36
CLOCK: [2023-05-11 Thu 10:38]--[2023-05-11 Thu 10:59] =>  0:21
CLOCK: [2023-05-10 Wed 16:38]--[2023-05-10 Wed 16:50] =>  0:12
CLOCK: [2023-05-10 Wed 16:36]--[2023-05-10 Wed 16:37] =>  0:01
CLOCK: [2023-05-10 Wed 12:49]--[2023-05-10 Wed 13:05] =>  0:16
CLOCK: [2023-05-09 Tue 14:56]--[2023-05-09 Tue 15:08] =>  0:12
CLOCK: [2023-05-05 Fri 14:17]--[2023-05-05 Fri 14:25] =>  0:08
CLOCK: [2023-05-04 Thu 15:09]--[2023-05-04 Thu 15:10] =>  0:01
CLOCK: [2023-05-04 Thu 14:53]--[2023-05-04 Thu 14:56] =>  0:03
CLOCK: [2023-04-28 Fri 09:13]--[2023-04-28 Fri 09:19] =>  0:06
CLOCK: [2023-04-27 Thu 17:19]--[2023-04-28 Fri 09:12] => 15:53
CLOCK: [2023-04-27 Thu 15:42]--[2023-04-27 Thu 17:18] =>  1:36
CLOCK: [2023-04-27 Thu 15:32]--[2023-04-27 Thu 15:41] =>  0:09
CLOCK: [2023-04-27 Thu 14:55]--[2023-04-27 Thu 15:31] =>  0:36
CLOCK: [2023-04-27 Thu 14:54]--[2023-04-27 Thu 14:55] =>  0:01
:END:
CREATED: [2023-04-27 Thu 14:54]
There are some weird errors in the UAT product that I am not seeing in the local one.
*** DONE Figure out how to use the updateBeneficiary function in this state-transistion :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-04 Thu 14:54]
- State "DONE"       from "TODO"       [2023-05-04 Thu 14:54] \\
  consulted prior wire req po I wrote and realized that I solved this issue before my calling the async update func in the init of a submission state and then after the async func finishes calling the submission's transition to effect the updates to context and then move to the next state
:LOGBOOK:
CLOCK: [2023-05-04 Thu 11:08]--[2023-05-04 Thu 14:53] =>  3:45
CLOCK: [2023-04-27 Thu 15:31]--[2023-04-27 Thu 15:32] =>  0:01
:END:
CREATED: [2023-04-27 Thu 15:31]
[[file:~/git/hub/Banno/custom-ux/packages/power-ons/polish-slavic-wire-request/src/app-controller.js::// const update = this.updateBeneficiary(context.beneficiaryChanges).then(u => u);]]
*** DONE bring styles into alignment with design :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-17 Wed 17:22]
- State "DONE"       from "TODO"       [2023-05-17 Wed 17:22] \\
  updated styles
:LOGBOOK:
CLOCK: [2023-05-17 Wed 11:49]--[2023-05-17 Wed 17:22] =>  5:33
CLOCK: [2023-05-04 Thu 15:06]--[2023-05-04 Thu 15:07] =>  0:01
:END:
CREATED: [2023-05-04 Thu 15:06]
*** DONE add validation to edit beneficiary pane :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-05 Fri 13:20]
- State "DONE"       from "TODO"       [2023-05-05 Fri 13:20] \\
  got validation working for both new and existing beneficiaries. Required having to change how state is managed a bit, but should make validation on the wire-request pane a lot easier
:LOGBOOK:
CLOCK: [2023-05-05 Fri 08:41]--[2023-05-05 Fri 13:20] =>  4:39
CLOCK: [2023-05-04 Thu 15:13]--[2023-05-04 Thu 17:00] =>  1:47
CLOCK: [2023-05-04 Thu 15:10]--[2023-05-04 Thu 15:12] =>  0:02
:END:
CREATED: [2023-05-04 Thu 15:07]
*** DONE add validation to wire request pane :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-05 Fri 14:17]
- State "DONE"       from "TODO"       [2023-05-05 Fri 14:17] \\
  got this finished rather quickly thanks to the work on the beneficiary-edit validation
:LOGBOOK:
CLOCK: [2023-05-05 Fri 13:20]--[2023-05-05 Fri 14:17] =>  0:57
CLOCK: [2023-05-04 Thu 15:07]--[2023-05-04 Thu 15:08] =>  0:01
:END:
CREATED: [2023-05-04 Thu 15:07]
*** DONE complete the confirmation pane :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-15 Mon 14:45]
- State "DONE"       from "TODO"       [2023-05-15 Mon 14:45] \\
  ezpz
- State "TODO"       from "HOLD"       [2023-05-10 Wed 12:50]
- State "HOLD"       from "TODO"       [2023-05-09 Tue 14:28] \\
  cannot proceed until JSON contract is updated with the sender's info
:LOGBOOK:
CLOCK: [2023-05-15 Mon 14:23]--[2023-05-15 Mon 14:45] =>  0:22
CLOCK: [2023-05-09 Tue 12:50]--[2023-05-09 Tue 14:29] =>  1:39
CLOCK: [2023-05-09 Tue 11:57]--[2023-05-09 Tue 12:08] =>  0:11
CLOCK: [2023-05-09 Tue 11:27]--[2023-05-09 Tue 11:56] =>  0:29
CLOCK: [2023-05-08 Mon 14:07]--[2023-05-08 Mon 15:20] =>  1:13
:END:
CREATED: [2023-05-04 Thu 15:08]
*** DONE setup wire-request submissions :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-09 Tue 11:27]
- State "DONE"       from "TODO"       [2023-05-09 Tue 11:27] \\
  finished this up, pretty simple really after the groundwork was laid down
:LOGBOOK:
CLOCK: [2023-05-09 Tue 11:04]--[2023-05-09 Tue 11:27] =>  0:23
CLOCK: [2023-05-09 Tue 09:15]--[2023-05-09 Tue 09:30] =>  0:15
CLOCK: [2023-05-08 Mon 12:14]--[2023-05-08 Mon 14:07] =>  1:53
CLOCK: [2023-05-08 Mon 11:47]--[2023-05-08 Mon 12:13] =>  0:26
CLOCK: [2023-05-08 Mon 09:46]--[2023-05-08 Mon 11:47] =>  2:01
CLOCK: [2023-05-04 Thu 15:08]--[2023-05-04 Thu 15:09] =>  0:01
:END:
CREATED: [2023-05-04 Thu 15:08]
*** DONE setup post-confirmation pane :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-15 Mon 16:14]
:LOGBOOK:
CLOCK: [2023-05-15 Mon 15:08]--[2023-05-15 Mon 15:48] =>  0:40
CLOCK: [2023-05-09 Tue 15:40]--[2023-05-09 Tue 15:50] =>  0:10
CLOCK: [2023-05-09 Tue 14:29]--[2023-05-09 Tue 14:56] =>  0:27
:END:
CREATED: [2023-05-04 Thu 15:09]
need to work on the dashed break, otherwise this is done
Got a visual break working:
#+begin_src CSS
.visual-break {
    width: 80%;
    border-bottom: 2px dashed grey;
    margin-bottom: 40px;
}
#+end_src
*** DONE error handling, including memo-mode :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-16 Tue 16:23]
- State "DONE"       from "TODO"       [2023-05-16 Tue 16:23] \\
  added error mode, might need to readdress this if they need more robust error handling
:LOGBOOK:
CLOCK: [2023-05-16 Tue 15:55]--[2023-05-16 Tue 16:23] =>  0:28
CLOCK: [2023-05-10 Wed 14:22]--[2023-05-10 Wed 14:34] =>  0:12
CLOCK: [2023-05-10 Wed 13:05]--[2023-05-10 Wed 13:06] =>  0:01
:END:
*** DONE add the delete functionality for beneficiary records :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-16 Tue 15:36]
- State "DONE"       from "TODO"       [2023-05-16 Tue 15:36] \\
  added delete feature. when deleting this was triggering an event in the edit pane. I added a `state` key to the event.detail object and if the state doesn't match the current state/pane it won't fire
:LOGBOOK:
CLOCK: [2023-05-16 Tue 14:30]--[2023-05-16 Tue 15:36] =>  1:06
CLOCK: [2023-05-16 Tue 12:30]--[2023-05-16 Tue 12:59] =>  0:29
CLOCK: [2023-05-08 Mon 12:13]--[2023-05-08 Mon 12:14] =>  0:01
:END:
CREATED: [2023-05-08 Mon 12:13]
*** DONE investigate UAT errors :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-12 Fri 13:56]
:LOGBOOK:
CLOCK: [2023-05-12 Fri 08:32]--[2023-05-12 Fri 13:56] =>  5:24
CLOCK: [2023-05-11 Thu 14:21]--[2023-05-11 Thu 16:30] =>  2:09
CLOCK: [2023-05-11 Thu 13:34]--[2023-05-11 Thu 14:00] =>  0:26
CLOCK: [2023-05-11 Thu 12:00]--[2023-05-11 Thu 12:43] =>  0:43
CLOCK: [2023-05-10 Wed 16:37]--[2023-05-10 Wed 16:38] =>  0:01
:END:
Written out, if the day number is less than the total number of chapters in the
section, just find ~total-chapters~ modulo ~day-number~. Otherwise, we flip the
numbers and find ~day-number~ modulo ~total-chapters~. Either way it will leave us
with the chapter we should be on currently.
CREATED: [2023-05-10 Wed 16:37]
at least some of this issue is from the poorly handled transaction object. After
the update POST I have changed it so that this object is correctly "merged" and
that took care of the issue I was seeing locally. I'm going to have to
investigate further to find out why there are still issues in UAT.
*** DONE remove back buttons from desktop and fix on mobile :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-17 Wed 17:22]
- State "DONE"       from "TODO"       [2023-05-17 Wed 17:22]
CREATED: [2023-05-15 Mon 11:57]
*** DONE fix section headings on inspect, edit, and confirmation panes :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-15 Mon 14:23]
- State "DONE"       from "TODO"       [2023-05-15 Mon 14:23] \\
  updated headings
:LOGBOOK:
CLOCK: [2023-05-15 Mon 14:14]--[2023-05-15 Mon 14:23] =>  0:09
:END:
CREATED: [2023-05-15 Mon 11:58]
*** DONE Add 'Address 2' labels to inspect, edit, and confirmation panes :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-15 Mon 12:16]
:LOGBOOK:
CLOCK: [2023-05-15 Mon 12:01]--[2023-05-15 Mon 12:16] =>  0:15
CLOCK: [2023-05-15 Mon 11:58]--[2023-05-15 Mon 11:59] =>  0:01
:END:
CREATED: [2023-05-15 Mon 11:58]
*** DONE 'Confirm' button should say 'Transfer' :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-15 Mon 12:27]
- State "DONE"       from "TODO"       [2023-05-15 Mon 12:27] \\
  updated button labels
:LOGBOOK:
CLOCK: [2023-05-15 Mon 12:17]--[2023-05-15 Mon 12:27] =>  0:10
:END:
CREATED: [2023-05-15 Mon 11:59]
*** DONE Add iban help text on edit pane :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-15 Mon 12:00]
- State "DONE"       from "TODO"       [2023-05-15 Mon 12:00] \\
  added iban text
CREATED: [2023-05-15 Mon 11:59]
*** DONE when adding new beneficiary, change text from "save" to "add beneficiary" :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-15 Mon 13:32]
- State "DONE"       from "TODO"       [2023-05-15 Mon 13:32] \\
  filter the beneficiary keys and if all are empty, it's a new beneficiary and we adjust text accordingly
:LOGBOOK:
CLOCK: [2023-05-15 Mon 12:36]--[2023-05-15 Mon 13:32] =>  0:56
CLOCK: [2023-05-15 Mon 11:59]--[2023-05-15 Mon 12:00] =>  0:01
:END:
CREATED: [2023-05-15 Mon 11:59]
*** KILL ensure on mobile going back to the previous screen sets the scroll location to previous scroll location :@work:REQUEST:KILL:ARCHIVE:
CLOSED: [2023-05-23 Tue 13:17]
- State "KILL"       from "TODO"       [2023-05-23 Tue 13:17] \\
  don't think this is needed
CREATED: [2023-05-15 Mon 18:04]
*** DONE fix odd behavior in UAT when selecting a country :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-18 Thu 10:16]
- State "DONE"       from "TODO"       [2023-05-18 Thu 10:16] \\
  PO server was sending a mix of upper and lower case country codes. added a sanitize function to set country codes to a known value regardless of what PO sends. also added sorting because the PO server's array of countries is sorted by the code not the name, thus leading to some very oddly sorted lists
:LOGBOOK:
CLOCK: [2023-05-18 Thu 09:15]--[2023-05-18 Thu 10:16] =>  1:01
:END:
CREATED: [2023-05-18 Thu 09:14]
*** DONE update PO based on review :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-19 Fri 12:52]
- State "DONE"       from "TODO"       [2023-05-19 Fri 12:52] \\
  deployed all reviewed items to UAT for further testing
:LOGBOOK:
CLOCK: [2023-05-19 Fri 09:43]--[2023-05-19 Fri 12:51] =>  3:08
:END:
CREATED: [2023-05-19 Fri 09:43]
*** DONE second round review :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-22 Mon 16:59]
- State "DONE"       from "TODO"       [2023-05-22 Mon 16:59] \\
  updated error messaging, some labels, and added basic iban validation
:LOGBOOK:
CLOCK: [2023-05-22 Mon 15:40]--[2023-05-22 Mon 16:59] =>  1:19
CLOCK: [2023-05-22 Mon 13:03]--[2023-05-22 Mon 14:44] =>  1:41
CLOCK: [2023-05-22 Mon 09:50]--[2023-05-22 Mon 12:05] =>  2:15
CLOCK: [2023-05-22 Mon 09:49]--[2023-05-22 Mon 09:50] =>  0:01
:END:
CREATED: [2023-05-22 Mon 09:49]
*** DONE use currency func to display amount :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-23 Tue 12:50]
- State "DONE"       from "TODO"       [2023-05-23 Tue 12:50] \\
  moved to currency func
:LOGBOOK:
CLOCK: [2023-05-23 Tue 12:16]--[2023-05-23 Tue 12:50] =>  0:34
:END:
CREATED: [2023-05-23 Tue 11:28]
*** KILL update jha-wc input base to disable asterisk :@work:REQUEST:KILL:ARCHIVE:
CLOSED: [2023-05-23 Tue 12:50]
- State "KILL"       from "TODO"       [2023-05-23 Tue 12:50] \\
  Chris submitted PR
:LOGBOOK:
CLOCK: [2023-05-23 Tue 12:05]--[2023-05-23 Tue 12:16] =>  0:11
:END:
CREATED: [2023-05-23 Tue 12:05]
** DONE Take both security training courses before June 1 [2/2] :@work:REQUEST:ARCHIVE:
CLOSED: [2023-06-05 Mon 17:41]
- State "DONE"       from "TODO"       [2023-06-05 Mon 17:41]
:LOGBOOK:
CLOCK: [2023-05-05 Fri 16:32]--[2023-05-05 Fri 16:33] =>  0:01
:END:
CREATED: [2023-04-28 Fri 09:19]
*** DONE take the security development course (long one) :@work:REQUEST:ARCHIVE:
CLOSED: [2023-06-05 Mon 17:41]
- State "DONE"       from "TODO"       [2023-06-05 Mon 17:41] \\
  finished course, took all day!
:LOGBOOK:
CLOCK: [2023-06-05 Mon 13:27]--[2023-06-05 Mon 17:41] =>  4:14
CLOCK: [2023-06-05 Mon 08:43]--[2023-06-05 Mon 13:26] =>  4:43
:END:
CREATED: [2023-05-05 Fri 14:25]
*** DONE take the security training (short one) :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-05 Fri 16:32]
- State "DONE"       from "TODO"       [2023-05-05 Fri 16:32] \\
  finished class
:LOGBOOK:
CLOCK: [2023-05-05 Fri 14:26]--[2023-05-05 Fri 16:32] =>  2:06
:END:
CREATED: [2023-05-05 Fri 14:25]
** TODO review Nebitt's resume  :@home:
SCHEDULED: <2023-04-28 Fri>
:LOGBOOK:
CLOCK: [2023-04-27 Thu 17:18]--[2023-04-27 Thu 17:19] =>  0:01
:END:
CREATED: [2023-04-27 Thu 17:18]
** TODO clean turtle tank, refill, fix filter  :@home:
:LOGBOOK:
CLOCK: [2023-05-04 Thu 15:12]--[2023-05-04 Thu 15:13] =>  0:01
:END:
CREATED: [2023-05-04 Thu 15:12]
*** DONE refill turtle tank :@home:ARCHIVE:
CLOSED: [2023-05-09 Tue 16:22]
- State "DONE"       from "TODO"       [2023-05-09 Tue 16:22]
CREATED: [2023-05-09 Tue 16:21]
*** TODO clean turtle tank  :@home:
CREATED: [2023-05-09 Tue 16:21]
*** DONE fix turtle filter :@home:ARCHIVE:
CLOSED: [2023-05-09 Tue 16:22]
- State "DONE"       from "TODO"       [2023-05-09 Tue 16:22] \\
  added mesh bag to hold clay balls so they do not get out of their tier
CREATED: [2023-05-09 Tue 16:21]
** TODO Look into adding the "back" button to desktop dev env   :@work:REQUEST:
CREATED: [2023-05-08 Mon 11:47]
likely this will need to be done in the poweron-lib package
** TODO CUS-2013 improve mocking  :@work:REQUEST:
:LOGBOOK:
CLOCK: [2023-05-19 Fri 12:52]--[2023-05-19 Fri 12:53] =>  0:01
CLOCK: [2023-05-10 Wed 10:56]--[2023-05-10 Wed 12:49] =>  1:53
CLOCK: [2023-05-10 Wed 09:33]--[2023-05-10 Wed 10:24] =>  0:51
CLOCK: [2023-05-10 Wed 09:21]--[2023-05-10 Wed 09:22] =>  0:01
CLOCK: [2023-05-09 Tue 16:26]--[2023-05-09 Tue 16:39] =>  0:13
CLOCK: [2023-05-09 Tue 16:14]--[2023-05-09 Tue 16:15] =>  0:01
:END:
CREATED: [2023-05-09 Tue 16:14]
*** TODO use fackerjs to improve mocking  :@work:REQUEST:
:LOGBOOK:
CLOCK: [2023-05-09 Tue 16:21]--[2023-05-09 Tue 16:26] =>  0:05
CLOCK: [2023-05-09 Tue 16:20]--[2023-05-09 Tue 16:21] =>  0:01
CLOCK: [2023-05-09 Tue 16:16]--[2023-05-09 Tue 16:18] =>  0:02
CLOCK: [2023-05-09 Tue 16:15]--[2023-05-09 Tue 16:16] =>  0:01
CLOCK: [2023-05-09 Tue 15:40]--[2023-05-09 Tue 16:14] =>  0:34
CLOCK: [2023-05-09 Tue 11:56]--[2023-05-09 Tue 11:57] =>  0:01
:END:
CREATED: [2023-05-09 Tue 11:56]
this might be a good thing to talk about in the required talk

[[https://www.npmjs.com/package/@anatine/zod-mock][This]] might be a neat tool to use. Instead of writing the fakerjs stuff, document
the API data and then allow that to be mocked automatically

*** TODO scenario mocks should extend default mocks to reduce redundancy  :@work:REQUEST:
:LOGBOOK:
CLOCK: [2023-05-09 Tue 16:19]--[2023-05-09 Tue 16:20] =>  0:01
:END:
CREATED: [2023-05-09 Tue 16:19]
*** TODO allow mocked paths to transform data instead of returning canned data  :@work:REQUEST:
:LOGBOOK:
CLOCK: [2023-05-09 Tue 16:18]--[2023-05-09 Tue 16:19] =>  0:01
:END:
CREATED: [2023-05-09 Tue 16:18]
*** TODO Consolidate redundant data into poweron-lib  :@work:REQUEST:
CREATED: [2023-05-09 Tue 16:16]
*** TODO create demo po for mock testing   :@work:REQUEST:
:LOGBOOK:
CLOCK: [2023-05-19 Fri 12:53]--[2023-05-19 Fri 14:19] =>  1:26
:END:
CREATED: [2023-05-19 Fri 12:52]
** TODO CUS-2033 transit wire request  :@work:REQUEST:
:LOGBOOK:
CLOCK: [2023-05-24 Wed 12:31]--[2023-05-24 Wed 19:21] =>  6:50
CLOCK: [2023-05-24 Wed 10:35]--[2023-05-24 Wed 11:55] =>  1:20
CLOCK: [2023-05-23 Tue 16:40]--[2023-05-23 Tue 17:00] =>  0:20
CLOCK: [2023-05-11 Thu 14:00]--[2023-05-11 Thu 14:20] =>  0:20
:END:
CREATED: [2023-05-11 Thu 14:00]
** DONE complete self assessment :@work:REQUEST:ARCHIVE:
CLOSED: [2023-05-24 Wed 12:29]
:LOGBOOK:
CLOCK: [2023-05-24 Wed 11:55]--[2023-05-24 Wed 12:30] =>  0:35
:END:
CREATED: [2023-05-24 Wed 11:55]
** TODO CUS-2464 Wellby Fin HELOC Adanced PO  :@work:REQUEST:
:LOGBOOK:
CLOCK: [2023-06-05 Mon 13:26]--[2023-06-05 Mon 13:27] =>  0:01
:END:
CREATED: [2023-06-05 Mon 13:26]
*** DONE review SOW prior to initial meeting :@work:REQUEST:ARCHIVE:
CLOSED: [2023-06-06 Tue 11:33]
- State "DONE"       from "TODO"       [2023-06-06 Tue 11:33] \\
  reviewed, not much to worry about on this one
CREATED: [2023-06-05 Mon 13:27]
* Appointments :APPOINTMENT:
* Notes :NOTES:
** NOTE This looks like a good read https://www.gnu.org/gnu/rms-lisp.html
CREATED: [2022-09-07 Wed 16:58]
** NOTE JHA helpdesk number: 1(877)846-5225
CREATED: [2022-10-10 Mon 09:18]
** NOTE picked up meat birds on or about March 30
CREATED: [2023-05-08 Mon 16:27]
** NOTE Need to improve the deep-merge function to better handle arrays
CREATED: [2023-04-27 Thu 15:42]
CREATED: [2023-05-04 Thu 15:09]
* Ideas :IDEAS:
** IDEA use a message queue or gotify or another similar service to capture to orgmode w/ the org-protocol
CREATED: [2022-08-15 Mon 10:13]
** IDEA topd -- The Org-Protocol daemon
Basically a daemon that monitors a queue or something similar and then
automatically adds those items to org-mode. Not sure if org-protocol is the
right thing to use, but maybe...
:LOGBOOK:
CLOCK: [2022-08-17 Wed 05:33]--[2022-08-17 Wed 05:34] =>  0:01
:END:
CREATED: [2022-08-17 Wed 05:33]
** IDEA Get a UPS for powering starlink and router during power outages
:LOGBOOK:
CLOCK: [2022-08-17 Wed 09:38]--[2022-08-17 Wed 09:39] =>  0:01
:END:
CREATED: [2022-08-17 Wed 09:38]
* Generic Tasks
** TODO Break :@work:
:PROPERTIES:
:ID:       855c4e50-a1ff-4ef8-8615-cd593acdbf4a
:END:
:LOGBOOK:
CLOCK: [2023-05-19 Fri 14:19]--[2023-05-19 Fri 15:19] =>  1:00
CLOCK: [2023-05-15 Mon 14:57]--[2023-05-15 Mon 15:08] =>  0:11
CLOCK: [2023-05-11 Thu 12:57]--[2023-05-11 Thu 13:34] =>  0:37
CLOCK: [2023-05-10 Wed 10:24]--[2023-05-10 Wed 10:56] =>  0:32
CLOCK: [2023-05-10 Wed 09:22]--[2023-05-10 Wed 09:32] =>  0:10
CLOCK: [2023-05-09 Tue 15:08]--[2023-05-09 Tue 15:39] =>  0:31
CLOCK: [2023-05-09 Tue 12:43]--[2023-05-09 Tue 12:50] =>  0:07
CLOCK: [2023-05-09 Tue 12:08]--[2023-05-09 Tue 12:43] =>  0:35
:END:
** TODO Morning Chores
:PROPERTIES:
:ID:       ceda582f-5914-43f3-99de-97acb207600a
:END:
:LOGBOOK:
CLOCK: [2022-09-03 Sat 07:16]--[2022-09-07 Wed 09:11] => 97:55
CLOCK: [2022-09-02 Fri 07:08]--[2022-09-02 Fri 08:18] =>  1:10
CLOCK: [2022-09-01 Thu 07:35]--[2022-09-01 Thu 08:50] =>  1:15
CLOCK: [2022-08-31 Wed 07:05]--[2022-08-31 Wed 08:11] =>  1:06
:END:
** TODO Generic Personal Project
:PROPERTIES:
:ID:       1c9fe465-40ee-4e0f-b5c0-afdba6362fc1
:END:
:LOGBOOK:
CLOCK: [2022-09-03 Sat 05:55]--[2022-09-03 Sat 06:33] =>  0:38
CLOCK: [2022-09-03 Sat 05:14]--[2022-09-03 Sat 05:55] =>  0:41
:END:
** TODO Idle Time Catch-all
:PROPERTIES:
:ID:       0a6abfc7-3d86-4a11-8ed4-85154df397f8
:END:
:LOGBOOK:
CLOCK: [2023-08-07 Mon 05:44]
CLOCK: [2023-08-07 Mon 05:38]--[2023-08-07 Mon 05:41] =>  0:03
CLOCK: [2023-06-08 Thu 11:29]--[2023-07-21 Fri 15:04] => 1035:35
CLOCK: [2023-06-08 Thu 09:56]--[2023-06-08 Thu 09:57] =>  0:01
CLOCK: [2023-06-05 Mon 17:41]--[2023-06-05 Mon 17:42] =>  0:01
CLOCK: [2023-06-05 Mon 08:42]--[2023-06-05 Mon 08:43] =>  0:01
CLOCK: [2023-05-24 Wed 12:30]--[2023-05-24 Wed 12:31] =>  0:01
CLOCK: [2023-05-23 Tue 11:53]--[2023-05-23 Tue 12:05] =>  0:12
CLOCK: [2023-05-23 Tue 09:27]--[2023-05-23 Tue 09:39] =>  0:12
CLOCK: [2023-05-22 Mon 15:39]--[2023-05-22 Mon 15:40] =>  0:01
CLOCK: [2023-05-22 Mon 09:37]--[2023-05-22 Mon 09:49] =>  0:12
CLOCK: [2023-05-19 Fri 17:00]--[2023-05-19 Fri 17:45] =>  0:45
CLOCK: [2023-05-19 Fri 09:42]--[2023-05-19 Fri 09:43] =>  0:01
CLOCK: [2023-05-18 Thu 09:14]--[2023-05-18 Thu 09:15] =>  0:01
CLOCK: [2023-05-16 Tue 10:37]--[2023-05-16 Tue 12:00] =>  1:23
CLOCK: [2023-05-15 Mon 11:46]--[2023-05-15 Mon 11:47] =>  0:01
CLOCK: [2023-05-12 Fri 08:31]--[2023-05-12 Fri 08:32] =>  0:01
CLOCK: [2023-05-11 Thu 09:41]--[2023-05-11 Thu 10:38] =>  0:57
CLOCK: [2023-05-10 Wed 09:32]--[2023-05-10 Wed 09:33] =>  0:01
CLOCK: [2023-05-09 Tue 15:39]--[2023-05-09 Tue 15:40] =>  0:01
CLOCK: [2023-05-09 Tue 09:07]--[2023-05-09 Tue 09:15] =>  0:08
CLOCK: [2023-05-08 Mon 16:27]--[2023-05-08 Mon 17:06] =>  0:39
CLOCK: [2023-05-08 Mon 15:20]--[2023-05-08 Mon 16:27] =>  1:07
CLOCK: [2023-05-08 Mon 08:45]--[2023-05-08 Mon 09:46] =>  1:01
CLOCK: [2023-05-05 Fri 06:00]--[2023-05-05 Fri 08:41] =>  2:41
CLOCK: [2023-05-04 Thu 14:56]--[2023-05-04 Thu 15:06] =>  0:10
CLOCK: [2023-05-04 Thu 11:07]--[2023-05-04 Thu 11:08] =>  0:01
CLOCK: [2023-05-04 Thu 10:54]--[2023-05-04 Thu 10:58] =>  0:04
CLOCK: [2023-04-28 Fri 09:12]--[2023-04-28 Fri 09:13] =>  0:01
CLOCK: [2022-09-23 Fri 08:55]--[2022-09-23 Fri 15:50] =>  6:55
CLOCK: [2022-09-02 Fri 09:18]--[2022-09-02 Fri 17:08] =>  7:50
CLOCK: [2022-09-02 Fri 07:05]--[2022-09-02 Fri 07:08] =>  0:03
CLOCK: [2022-08-31 Wed 08:11]--[2022-08-31 Wed 08:12] =>  0:01
CLOCK: [2022-08-31 Wed 05:28]--[2022-08-31 Wed 07:05] =>  1:37
CLOCK: [2022-08-22 Mon 15:01]--[2022-08-22 Mon 15:47] =>  0:46
CLOCK: [2022-08-17 Wed 13:20]--[2022-08-17 Wed 13:26] =>  0:06
CLOCK: [2022-08-17 Wed 09:47]--[2022-08-17 Wed 13:20] =>  3:33
CLOCK: [2022-08-17 Wed 09:39]--[2022-08-17 Wed 09:46] =>  0:07
CLOCK: [2022-08-17 Wed 05:34]--[2022-08-17 Wed 09:38] =>  4:04
CLOCK: [2022-08-15 Mon 13:03]--[2022-08-15 Mon 13:27] =>  0:24
CLOCK: [2022-08-15 Mon 12:28]--[2022-08-15 Mon 12:29] =>  0:01
:END:
* Meeting
** MEET with interview with JHA/Banno :MEETING:
:LOGBOOK:
CLOCK: [2022-09-19 Mon 11:33]--[2022-09-19 Mon 13:19] =>  1:46
:END:
CREATED: [2022-09-19 Mon 11:33]
** MEET with w/ Brian @ JHA for offer/negotiation :MEETING:
:LOGBOOK:
CLOCK: [2022-09-20 Tue 10:01]--[2022-09-20 Tue 14:47] =>  4:46
:END:
CREATED: [2022-09-20 Tue 10:01]
** MEET with Team Custom (weekly meeting) :MEETING:
:LOGBOOK:
CLOCK: [2023-05-04 Thu 09:32]--[2023-05-04 Thu 10:54] =>  1:22
:END:
CREATED: [2023-05-04 Thu 09:32]
- [[https://github.com/wclr/yalc][yalc]] build tool shown off
** MEET with Customer PO Teams :MEETING:
:LOGBOOK:
CLOCK: [2023-05-04 Thu 10:58]--[2023-05-04 Thu 11:07] =>  0:09
:END:
CREATED: [2023-05-04 Thu 10:58]
- working on the state-machine for P/S Wire Request
- Transit Wire Request is ready for the FI to review
** MEET with UX team :MEETING:
:LOGBOOK:
CLOCK: [2023-05-09 Tue 09:30]--[2023-05-09 Tue 11:04] =>  1:34
:END:
CREATED: [2023-05-09 Tue 09:30]
** MEET with power-on team :MEETING:
:LOGBOOK:
CLOCK: [2023-05-11 Thu 10:59]--[2023-05-11 Thu 11:24] =>  0:25
:END:
CREATED: [2023-05-11 Thu 10:59]
** MEET with ux team :MEETING:
:LOGBOOK:
CLOCK: [2023-05-16 Tue 09:30]--[2023-05-16 Tue 10:19] =>  0:49
:END:
CREATED: [2023-05-16 Tue 09:30]

got the go-ahead to update the jha-wc repo to optionally remove the asterisk
** MEET with custom team :MEETING:
:LOGBOOK:
CLOCK: [2023-05-16 Tue 12:59]--[2023-05-16 Tue 14:30] =>  1:31
:END:
CREATED: [2023-05-16 Tue 12:59]
regarding templates.
** MEET with Brian (1:1) :MEETING:
:LOGBOOK:
CLOCK: [2023-05-17 Wed 11:00]--[2023-05-17 Wed 11:49] =>  0:49
:END:
CREATED: [2023-05-17 Wed 11:00]
PS wire req. po is late
** MEET with custom dev :MEETING:
:LOGBOOK:
CLOCK: [2023-05-18 Thu 10:18]--[2023-05-18 Thu 11:53] =>  1:35
:END:
CREATED: [2023-05-18 Thu 10:18]
** MEET with sig-tulip :MEETING:
:LOGBOOK:
CLOCK: [2023-05-22 Mon 12:05]--[2023-05-22 Mon 13:03] =>  0:58
:END:
CREATED: [2023-05-22 Mon 12:05]
** MEET with ux team :MEETING:
:LOGBOOK:
CLOCK: [2023-05-24 Wed 09:30]--[2023-05-24 Wed 10:35] =>  1:05
:END:
CREATED: [2023-05-24 Wed 09:30]
zod and facker idea went over well
talked about localization
** MEET with ux team :MEETING:
:LOGBOOK:
CLOCK: [2023-06-06 Tue 09:33]--[2023-06-06 Tue 11:04] =>  1:31
:END:
CREATED: [2023-06-06 Tue 09:33]
talked about allowing style tags in soft text. I suggested using classes similar to css frameworks instead
caught up on the two wire req POs
will talk to Brian about working on templates
** MEET with Wellby HELOC transfer :MEETING:
:LOGBOOK:
CLOCK: [2023-06-06 Tue 11:04]--[2023-06-06 Tue 11:33] =>  0:29
:END:
CREATED: [2023-06-06 Tue 11:04]
No design, just mimic the existing transfer.
Disclosure comes after transfer settings
Need a warning/error to notify user when loan amount does not mean minimum transfer amount
No current due date
** MEET with custom team meeting :MEETING:
:LOGBOOK:
CLOCK: [2023-06-08 Thu 09:30]--[2023-06-08 Thu 10:58] =>  1:28
:END:
CREATED: [2023-06-08 Thu 09:30]
** MEET with PO team meeting :MEETING:
:LOGBOOK:
CLOCK: [2023-06-08 Thu 10:58]--[2023-06-08 Thu 11:29] =>  0:31
:END:
CREATED: [2023-06-08 Thu 10:58]
